app/views/tasks/index.html.haml

SELECT "completions".* FROM "completions" WHERE "completions"."user_id" = 2 AND "completions"."task_id" = 3 AND "completions"."completed" = '2012-11-16' LIMIT 1
---
                = link_to task.title, task
              -if Completion.find_by_user_id_and_task_id_and_completed(@user.id, task.id, @time)
                .span1