app/views/users/_card.html.haml

        %td
          - today_complete = Completion.where(completed: Date.today.to_s, user_id: user.id, task_id: @todays.collect(&:id)).count
---
SELECT COUNT(*) FROM "completions" WHERE "completions"."completed" = '2012-11-16' AND "completions"."user_id" = 2 AND "completions"."task_id" IN (6)