app/controllers/tasks_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."daily" = 't' AND "tasks"."user_id" IS NULL
SELECT "tasks".* FROM "tasks" WHERE "tasks"."weekly" = 't' AND "tasks"."user_id" IS NULL
SELECT "tasks".* FROM "tasks" WHERE "tasks"."monthly" = 't' AND "tasks"."user_id" IS NULL
---
  def index
    @user = User.find(params[:user_id])
    date = Date.parse(Date.today.to_s).strftime("%A").downcase
    @todays = Task.where(daily: true, user_id: @user.id)
    @todays = @todays + Task.where(user_id: @user.id, date.intern => true)
    @this_weeks = Task.where(weekly: true, user_id: @user.id)
    @this_months = Task.where(monthly: true, user_id: @user.id)

SELECT "users".* FROM "users" WHERE "users"."parent_id" = 1 AND "users"."id" = 1
---
  def new
    @task = Task.new
    @users = User.where(parent_id: current_user.id)

SELECT "users".* FROM "users" WHERE "users"."parent_id" = 1
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @users = User.where(parent_id: current_user.id)
    @users << current_user
    @task = Task.find(params[:id])

INSERT INTO "tasks" ("created_at", "custom_start", "daily", "description", "friday", "how_often", "monday", "monthly", "next_date", "period", "points", "saturday", "sunday", "thursday", "title", "tuesday", "updated_at", "user_id", "wednesday", "weekly") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @task = Task.new(params[:task])

    if params[:task][:period] == nil
      @task.period = 0
    end

    if params[:task][:points] == ""
      @task.points = 0
    end

    respond_to do |format|
      if @task.save