app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."parent_id" = 1 AND "users"."user_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."daily" = 't' AND "tasks"."user_id" = 2
SELECT "tasks".* FROM "tasks" WHERE "tasks"."weekly" = 't' AND "tasks"."user_id" = 2
SELECT "tasks".* FROM "tasks" WHERE "tasks"."monthly" = 't' AND "tasks"."user_id" = 2
---
  def index
    @users = User.where(parent_id: current_user.id)

    @todays = Array.new
    @this_weeks = Array.new
    @this_months = Array.new

    date = Date.parse(Date.today.to_s).strftime("%A").downcase

    @users.each do |user|
      Task.where(daily: true, user_id: user.id).each do |task|
        @todays << task
      end
      Task.where(user_id: user.id, date.intern => true).each do |task|
        @todays << task
      end
      Task.where(weekly: true, user_id: user.id).each do |task|
        @this_weeks << task
      end
      Task.where(monthly: true, user_id: user.id).each do |task|

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."daily" = 't' AND "tasks"."user_id" = 1
SELECT "tasks".* FROM "tasks" WHERE "tasks"."weekly" = 't' AND "tasks"."user_id" = 1
SELECT "tasks".* FROM "tasks" WHERE "tasks"."monthly" = 't' AND "tasks"."user_id" = 1
---
  def show
    @user = User.find(params[:id])

    @todays = Task.where(daily: true, user_id: @user.id)

    @this_weeks = Task.where(weekly: true, user_id: @user.id)

    @this_months = Task.where(monthly: true, user_id: @user.id)

SELECT "users".* FROM "users" WHERE "users"."facebook_id" = '100004162872022' LIMIT 1
INSERT INTO "users" ("created_at", "facebook_id", "name", "parent_id", "theme_id", "thumbnail", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    if params[:user][:parent_id]
      @user.parent_id = User.find_by_facebook_id(params[:user][:parent_id]).id
    end

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."facebook_id" = '100004162872022' LIMIT 1
UPDATE "users" SET "parent_id" = 100004162872022, "thumbnail" = '{:id=>"thumbnail1", :value=>"User1.png", :checked=>"checked"}', "updated_at" = '2012-11-12 21:21:16.943272' WHERE "users"."id" = 2
---
  def update
    @user = User.find(params[:id])

    @user.name = params[:user][:name]

    if params[:user][:parent_id]
      @user.parent_id = User.find_by_facebook_id(params[:user][:parent_id]).id
    end

    if params[:user][:thumbnail]
      @user.thumbnail = params[:user][:thumbnail]
    end

    respond_to do |format|
      if @user.save